app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 1]]
---
                    <hr>
                    <% @article.comments.each do |comment| %>