app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "categories".* FROM "categories"
---
  def show
    @article = Article.find(params[:id])
    @categories = Category.all

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Tess"], ["text", "sdfasdfa"], ["created_at", "2015-11-13 07:39:48.979425"], ["updated_at", "2015-11-13 07:39:48.979425"]]
---
  def create
    @category = Category.find(params[:category_id])
    @article = @category.articles.create(article_params)