app/controllers/categories_controller.rb

INSERT INTO "categories" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "123123"], ["created_at", "2015-11-14 10:05:48.274117"], ["updated_at", "2015-11-14 10:05:48.274117"]]
---
  def create
    @category = Category.new(category_params)
    @category.save